/* Напишите на языке C / C++ программу поиска максимальной по длине монотонно
 * неубывающей подпоследовательности во входной последовательности вещественных
 * чисел. Если таких подпоследовательностей несколько, выведите первую из них
 * (найденную при просмотре входного потока первой).
 *
 * Примечание: искомая подпоследовательность является «плотной», в ней нет
 * разрывов и посторонних элементов, включая числовые значения.
 *
 * Вход: одно целое N (длина последовательности; возможно, со знаком «плюс»),
 * за которым следует k вещественных чисел в любой разрешенной форме записи
 * (и, возможно, символ «перевод строки» /n). Если k = N, анализируется входная
 * последовательность вещественных целиком; если k > N, анализируется только N
 * первых (расположенных в традиционной записи слева) членов этой
 * последовательности. Если k < N (возможно, k = 0) или N < 2, входная
 * последовательность некорректна.
 *
 * Выход: два целых (натуральных), первое из которых L соответствует длине, а
 * второе — порядковому номеру i первого элемента найденной
 * подпоследовательности (принять i = 1, 2, 3, ...). Если входная
 * последовательность корректна, но искомая подпоследовательность не
 * обнаружена, вывести символ 0 (ноль). Во всех случаях подачи на вход
 * некорректных, в том числе символьных / строковых данных, вывести строку
 * [error] (вместе с квадратными скобками).
 */

#include <iostream>

int main()
{

    return 0;
}
